import Soundfont from "soundfont-player";

// Constants
let ac = new AudioContext();
const Audio = {
    Context: ac,
    Instrument: [Soundfont.instrument(ac, 'acoustic_grand_piano', { soundfont: 'FluidR3_GM' }), // Piano
                 Soundfont.instrument(ac, 'acoustic_guitar_nylon', { soundfont: 'FluidR3_GM' }), // Guitar
                 Soundfont.instrument(ac, 'muted_trumpet', { soundfont: 'FluidR3_GM' }) // Trumpet
                ]
}

const Intervals = [
        {
            label: "פרימה זכה",
            value: 0
        },
        {
            label: "סקונדה קטנה",
            value:0.5
        },
        {
            label:"סקונדה גדולה",
            value:1
        },
        {
            label: "טרצה קטנה",
            value: 1.5
        },
        {
            label: "טרצה גדולה",
            value: 2
        },
        {
            label: "קוורטה זכה",
            value: 2.5
        },
        {
            label: "טריטון",
            value: 3
        },
        {
            label: "קווינטה זכה",
            value: 3.5
        },
        {
            label: "סקסטה קטנה",
            value: 4
        },
        {
            label: "סקסטה גדולה",
            value: 4.5
        },
        {
            label: "ספטימה קטנה",
            value: 5
        },
        {
            label: "ספטימה גדולה",
            value: 5.5
        },
        {
            label: "אוקטבה זכה",
            value: 6
        },
        {
            label: "נונה קטנה",
            value: 6.5
        },
        {
            label: "נונה גדולה",
            value: 7
        }
]

const MidiNumbers = {
        24: "דו1",
        25: "דו דיאז1/רה במול1",
        26: "רה1",
        27: "רה דיאז1/מי במול1",
        28: "מי1",
        29: "פה1",
        30: "פה דיאז1/סול במול1",
        31: "סול1",
        32: "סול דיאז1/לה במול",
        33: "לה1",
        34: "לה דיאז1/סי במול",
        35: "סי1",
        36: "דו2",
        37: "דו דיאז2/רה במול2",
        38: "רה2",
        39: "רה דיאז2/מי במול2",
        40: "מי2",
        41: "פה2",
        42: "פה דיאז2/סול במול2",
        43: "סול2",
        44: "סול דיאז2/לה במול2",
        45: "לה2",
        46: "לה דיאז2/סי במול",
        47: "סי2",
        48: "דו3",
        49: "דו דיאז3/רה במול3",
        50: "רה3",
        51: "רה דיאז3/מי במול3",
        52: "מי3",
        53: "פה3",
        54: "פה דיאז3/סול במול3",
        55: "סול3",
        56: "סול דיאז3/לה במול",
        57: "לה3",
        58: "לה דיאז3/סי במול",
        59: "סי3",
        60: "דו אמצעי", // Middle C
        61: "דו דיאז4/רה במול4",
        62: "רה4",
        63: "רה דיאז4/מי במול4",
        64: "מי4",
        65: "פה4",
        66: "פה דיאז4/סול במול4",
        67: "סול4",
        68: "סול דיאז4/לה במול",
        69: "לה4",
        70: "לה דיאז4/סי במול",
        71: "סי4",
        72: "דו5",
        73: "דו דיאז5/רה במול5",
        74: "רה5",
        75: "רה דיאז5/מי במול5",
        76: "מי5",
        77: "פה5",
        78: "פה דיאז5/סול במול5",
        79: "סול5",
        80: "סול דיאז5/לה במול",
        81: "לה5",
        82: "לה דיאז5/סי במול",
        83: "סי5",
        84: "דו6"
    }


export {Audio, Intervals, MidiNumbers};